## Introduction: Connecting to the Database

In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

The database we are going to use for this project is the Chinook database (chinook).

Chinook is a sample database available for SQL Server, Oracle, MySQL, etc. It can be created by running a single SQL script. Chinook database is an alternative to the Northwind database, being ideal for demos and testing ORM tools targeting single and multiple database servers.

## Information on the Tables and Views in the Database

In [2]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///chinook.db
Done.

[('albums', 'table'),
 ('sqlite_sequence', 'table'),
 ('artists', 'table'),
 ('customers', 'table'),
 ('employees', 'table'),
 ('genres', 'table'),
 ('invoices', 'table'),
 ('invoice_items', 'table'),
 ('media_types', 'table'),
 ('playlists', 'table'),
 ('playlist_track', 'table'),
 ('tracks', 'table'),
 ('sqlite_stat1', 'table')]

From the results we can deduce that there are no views but only tables in the database. 

Let's describe the tables in the database in much more detail below.

##  Chinook Sample Database Tables

There are 11 tables in the chinook sample database.
- **employees** table: stores employees data such as employee id, last name, first name, etc. It also has a field named ReportsTo to specify who reports to whom.
- **customers** table:  stores customers data.
- **invoices & invoice_items** tables: these two tables store invoice data. The invoices table stores invoice header data and the invoice_items table stores the invoice line items data.
- **artists** table stores artists data. It is a simple table that contains only the artist id and name.
- **albums** table stores data about a list of tracks. Each album belongs to one artist. However, one artist may have multiple albums.
- **media_types** table stores media types such as MPEG audio and AAC audio files.
- **genres** table stores music types such as rock, jazz, metal, etc.
- **tracks** table stores the data of songs. Each track belongs to one album.
- **playlists & playlist_track** tables: playlists table store data about playlists. Each playlist contains a list of tracks. Each track may belong to multiple playlists. The relationship between the playlists table and tracks table is many-to-many. The playlist_track table is used to reflect this relationship.

## Schema Diagram

The above tables in the chinook database are related to each other and they are pre-populated with data. Here database's data model design:

<img src="https://cdn.sqlitetutorial.net/wp-content/uploads/2015/11/sqlite-sample-database-color.jpg" />

## Exploring the contents of some of the tables

In [11]:
%%sql
SELECT *
FROM invoice_items
LIMIT 10

 * sqlite:///chinook.db
Done.

[(1, 1, 2, 0.99, 1),
 (2, 1, 4, 0.99, 1),
 (3, 2, 6, 0.99, 1),
 (4, 2, 8, 0.99, 1),
 (5, 2, 10, 0.99, 1),
 (6, 2, 12, 0.99, 1),
 (7, 3, 16, 0.99, 1),
 (8, 3, 20, 0.99, 1),
 (9, 3, 24, 0.99, 1),
 (10, 3, 28, 0.99, 1)]

In [4]:
%%sql
SELECT *
FROM customers
where Country = 'USA'
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(16, 'Frank', 'Harris', 'Google Inc.', '1600 Amphitheatre Parkway', 'Mountain View', 'CA', 'USA', '94043-1351', '+1 (650) 253-0000', '+1 (650) 253-0000', 'fharris@google.com', 4),
 (17, 'Jack', 'Smith', 'Microsoft Corporation', '1 Microsoft Way', 'Redmond', 'WA', 'USA', '98052-8300', '+1 (425) 882-8080', '+1 (425) 882-8081', 'jacksmith@microsoft.com', 5),
 (18, 'Michelle', 'Brooks', None, '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', '+1 (212) 221-3546', '+1 (212) 221-4679', 'michelleb@aol.com', 3),
 (19, 'Tim', 'Goyer', 'Apple Inc.', '1 Infinite Loop', 'Cupertino', 'CA', 'USA', '95014', '+1 (408) 996-1010', '+1 (408) 996-1011', 'tgoyer@apple.com', 3),
 (20, 'Dan', 'Miller', None, '541 Del Medio Avenue', 'Mountain View', 'CA', 'USA', '94040-111', '+1 (650) 644-3358', None, 'dmiller@comcast.com', 4),
 (21, 'Kathy', 'Chase', None, '801 W 4th Street', 'Reno', 'NV', 'USA', '89503', '+1 (775) 223-7665', None, 'kachase@hotmail.com', 5),
 (22, 'Heather', 'Leacock', None, '120 S Orange Ave', 'Orlando', 'FL', 'USA', '32801', '+1 (407) 999-7788', None, 'hleacock@gmail.com', 4),
 (23, 'John', 'Gordon', None, '69 Salem Street', 'Boston', 'MA', 'USA', '2113', '+1 (617) 522-1333', None, 'johngordon22@yahoo.com', 4),
 (24, 'Frank', 'Ralston', None, '162 E Superior Street', 'Chicago', 'IL', 'USA', '60611', '+1 (312) 332-3232', None, 'fralston@gmail.com', 3),
 (25, 'Victor', 'Stevens', None, '319 N. Frances Street', 'Madison', 'WI', 'USA', '53703', '+1 (608) 257-0597', None, 'vstevens@yahoo.com', 5)]

## Selecting New Albums to Purchase

In [12]:
%%sql
SELECT it.* FROM invoice_items it
INNER JOIN invoices i on it.invoiceId = i.invoiceId
INNER JOIN customers c on i.customerId = c.customerId
WHERE c.Country = 'USA'
LIMIT 10

 * sqlite:///chinook.db
Done.

[(74, 13, 462, 0.99, 1),
 (723, 134, 907, 0.99, 1),
 (724, 134, 909, 0.99, 1),
 (782, 145, 1236, 0.99, 1),
 (783, 145, 1245, 0.99, 1),
 (784, 145, 1254, 0.99, 1),
 (785, 145, 1263, 0.99, 1),
 (786, 145, 1272, 0.99, 1),
 (787, 145, 1281, 0.99, 1),
 (788, 145, 1290, 0.99, 1)]

In [6]:
%%sql
WITH tracks_sold_usa AS
   (
    SELECT it.* FROM invoice_items it
    INNER JOIN invoices i on it.invoiceId = i.invoiceId
    INNER JOIN customers c on i.customerId = c.customerId
    WHERE c.Country = 'USA'
   )
    
SELECT
    g.name genre,
    count(tsu.InvoiceLineId) tracks_sold,
    cast(count(tsu.InvoiceLineId) AS FLOAT) / (
        SELECT COUNT(*) from tracks_sold_usa
    ) percentage_sold
FROM tracks_sold_usa tsu
INNER JOIN tracks t on t.trackid = tsu.trackid
INNER JOIN genres g on g.genreid = t.genreid
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[('Rock', 157, 0.31781376518218624),
 ('Latin', 91, 0.18421052631578946),
 ('Metal', 64, 0.12955465587044535),
 ('Alternative & Punk', 50, 0.10121457489878542),
 ('Jazz', 22, 0.044534412955465584),
 ('Blues', 15, 0.030364372469635626),
 ('TV Shows', 14, 0.02834008097165992),
 ('R&B/Soul', 12, 0.024291497975708502),
 ('Comedy', 8, 0.016194331983805668),
 ('Classical', 8, 0.016194331983805668)]

Based on the sales of tracks across different genres in the USA, we should purchase the new albums by the following artists:

    Red Tone (Punk)
    Slim Jim Bites (Blues)

It's so strange that Hip Hop and Pop genres are not part of the list. It's worth investigating why. 

Also the results table suggests that we should be on the lookout for artists and albums from the 'rock' genre, which accounts for 32% of sales.

## Employee Sales Performance

In [7]:
%%sql

WITH customer_support_rep_sales AS
    (
     SELECT
         i.customerId,
         c.supportRepId,
         SUM(i.total) total
     FROM invoices i
     INNER JOIN customers c ON i.customerId = c.customerId
     GROUP BY 1,2
    )

SELECT
    e.firstName || " " || e.lastName employees,
    e.hireDate,
    SUM(csrs.total) total_sales
FROM customer_support_rep_sales csrs
INNER JOIN employees e ON e.employeeId = csrs.supportRepId
GROUP BY 1;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', '2002-04-01 00:00:00', 833.0400000000001),
 ('Margaret Park', '2003-05-03 00:00:00', 775.4000000000001),
 ('Steve Johnson', '2003-10-17 00:00:00', 720.1600000000001)]

Even if the difference in sales between Jane (the top employee) and Steve (the bottom employee) is almost 14%, the difference is most likely due to the fact that Jane Peacock has stayed at the company for a longer period considering the difference in hiring dates.

## Sales by Country

In [8]:
%%sql

WITH country_or_other AS
    (
     SELECT
       CASE
           WHEN (
                 SELECT count(*)
                 FROM customers
                 where Country = c.Country
                ) = 1 THEN "Other"
           ELSE c.Country
       END AS country,
       c.customerId,
       it.*
     FROM invoice_items it
     INNER JOIN invoices i ON i.invoiceId = it.invoiceId
     INNER JOIN customers c ON c.customerId = i.customerId
    )

SELECT
    country,
    customers,
    total_sales,
    average_order,
    customer_lifetime_value
FROM
    (
    SELECT
        country,
        count(distinct customerId) customers,
        SUM(unitPrice) total_sales,
        SUM(unitPrice) / count(distinct customerId) customer_lifetime_value,
        SUM(unitPrice) / count(distinct invoiceId) average_order,
        CASE
            WHEN country = "Other" THEN 1
            ELSE 0
        END AS sort
    FROM country_or_other
    GROUP BY country
    ORDER BY sort ASC, total_sales DESC
    );

 * sqlite:///chinook.db
Done.

[('USA', 13, 523.060000000003, 5.747912087912121, 40.235384615384845),
 ('Canada', 8, 303.9600000000013, 5.427857142857166, 37.99500000000016),
 ('France', 5, 195.1000000000003, 5.574285714285723, 39.02000000000006),
 ('Brazil', 5, 190.10000000000028, 5.4314285714285795, 38.02000000000005),
 ('Germany', 4, 156.48, 5.588571428571428, 39.12),
 ('United Kingdom', 3, 112.85999999999979, 5.374285714285704, 37.619999999999926),
 ('Czech Republic', 2, 90.23999999999997, 6.445714285714283, 45.11999999999998),
 ('Portugal', 2, 77.23999999999998, 5.517142857142856, 38.61999999999999),
 ('India', 2, 75.25999999999998, 5.789230769230768, 37.62999999999999),
 ('Other', 15, 604.3000000000037, 5.755238095238131, 40.28666666666691)]

Based on the data, there may be opportunity in Czech Republic, and India- considering they have quite high average order numbers.

Also we should not forget the sample size from each of these countries is relatively low. 
Consequently, we should be cautious investing too much money on new marketing campaigns. 
Hence it would be wise to run small campaigns in these countries, collect and analyze the new customers to make sure that these trends hold with new customers.

## Albums vs Individual Tracks

In [9]:
%%sql

WITH invoice_first_track AS
    (
     SELECT
         it.invoiceId invoiceId,
         MIN(it.trackId) first_track_id
     FROM invoice_items it
     GROUP BY 1
    )

SELECT
    album_purchase,
    COUNT(invoiceId) number_of_invoices,
    CAST(count(invoiceId) AS FLOAT) / (
                                         SELECT COUNT(*) FROM invoices
                                      ) percent
FROM
    (
    SELECT
        ifs.*,
        CASE
            WHEN
                 (
                  SELECT t.trackId FROM tracks t
                  WHERE t.albumId = (
                                      SELECT t2.albumId FROM tracks t2
                                      WHERE t2.trackId = ifs.first_track_id
                                     ) 

                  EXCEPT 

                  SELECT it2.trackId FROM invoice_items it2
                  WHERE it2.invoiceId = ifs.invoiceId
                 ) IS NULL
             AND
                 (
                  SELECT it2.trackId FROM invoice_items it2
                  WHERE it2.invoiceId = ifs.invoiceId

                  EXCEPT 

                  SELECT t.trackId FROM tracks t
                  WHERE t.albumId = (
                                      SELECT t2.albumId FROM tracks t2
                                      WHERE t2.trackId = ifs.first_track_id
                                     ) 
                 ) IS NULL
             THEN "yes"
             ELSE "no"
         END AS "album_purchase"
     FROM invoice_first_track ifs
    )
GROUP BY album_purchase;

 * sqlite:///chinook.db
Done.

[('no', 410, 0.9951456310679612), ('yes', 2, 0.0048543689320388345)]

Album purchases account for only 0.4% of purchases. Based on this data, I would suggest purchasing only select tracks from albums from record companies, since they account for almost 100% of revenue.